000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. TRUNC03.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600
000700 01  6-BYTES      PIC X(6).
000800 01  5-BYTES      PIC X(5).
000900 01  4-BYTES      PIC X(4).
001000 01  3-BYTES      PIC X(3).
001100 01  2-BYTES      PIC X(2).
001200 01  1-BYTE       PIC X(1).
001300
001400 01  5-DIGITS     PIC 9(5).
001500 01  4-DIGITS     PIC 9(4).
001600 01  3-DIGITS     PIC 9(3).
001700 01  2-DIGITS     PIC 9(2).
001800 01  1-DIGIT      PIC 9(1).
001900
002000 PROCEDURE DIVISION.
002100 PROGRAM-BEGIN.
002200
002300     MOVE "Hello" TO 6-BYTES 5-BYTES
002400                     4-BYTES 3-BYTES
002500                     2-BYTES 1-BYTE.
002600
002700     MOVE 2397 TO 5-DIGITS
002800                  4-DIGITS
002900                  3-DIGITS
003000                  2-DIGITS
003100                  1-DIGIT.
003200
003300     DISPLAY 6-BYTES.
003400     DISPLAY 5-BYTES.
003500     DISPLAY 4-BYTES.
003600     DISPLAY 3-BYTES.
003700     DISPLAY 2-BYTES.
003800     DISPLAY 1-BYTE.
003900
004000     DISPLAY 5-DIGITS.
004100     DISPLAY 4-DIGITS.
004200     DISPLAY 3-DIGITS.
004300     DISPLAY 2-DIGITS.
004400     DISPLAY 1-DIGIT.
004500
004600
004700 PROGRAM-DONE.
004800     STOP RUN.
004900
