000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. TIMEDIT.
000300*---------------------------------
000400* TIME ENTRY AND VALIDATION SUB PROGRAM
000500*---------------------------------
000600 ENVIRONMENT DIVISION.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200
001300 WORKING-STORAGE SECTION.
001400
001500 77  VALID-TIME-FLAG    PIC X.
001600     88  TIME-IS-INVALID  VALUE "N".
001700     88  TIME-IS-ZERO     VALUE "0".
001800     88  TIME-IS-VALID    VALUE "Y".
001900     88  TIME-IS-OK       VALUES "Y" "0".
002000
002100 LINKAGE SECTION.
002200*---------------------------------
002300* Fields passed for TIME routines.
002400*---------------------------------
002500 77  FORMATTED-TIME     PIC Z9/99/99.
002600
002700 01  TIME-HHMMSS      PIC 9(6).
002800 01  FILLER REDEFINES TIME-HHMMSS.
002900     05  TIME-HH        PIC 99.
003000     05  TIME-MM        PIC 99.
003100     05  TIME-SS        PIC 99.
003200
003300 77  ZERO-TIME-IS-OK    PIC X VALUE "N".
003400
003500 PROCEDURE DIVISION
003600     USING TIME-HHMMSS FORMATTED-TIME
003700           ZERO-TIME-IS-OK.
003800
003900 PROGRAM-BEGIN.
004000     PERFORM OPENING-PROCEDURE.
004100     PERFORM MAIN-PROCESS.
004200     PERFORM CLOSING-PROCEDURE.
004300
004400 PROGRAM-EXIT.
004500     EXIT PROGRAM.
004600
004700 PROGRAM-DONE.
004800     ACCEPT OMITTED. STOP RUN.
004900
005000 OPENING-PROCEDURE.
005100
005200 CLOSING-PROCEDURE.
005300
005400 MAIN-PROCESS.
005500     PERFORM GET-A-TIME.
005600
005700 GET-A-TIME.
005800     PERFORM ACCEPT-A-TIME.
005900     PERFORM RE-ACCEPT-A-TIME
006000         UNTIL TIME-IS-OK.
006100
006200 ACCEPT-A-TIME.
006300     DISPLAY "ENTER A TIME (HH:MM:SS)".
006400
006500     ACCEPT FORMATTED-TIME.
006600
006700     PERFORM EDIT-CHECK-TIME.
006800
006900 RE-ACCEPT-A-TIME.
007000     DISPLAY "INVALID TIME".
007100
007200     PERFORM ACCEPT-A-TIME.
007300
007400 EDIT-CHECK-TIME.
007500     PERFORM EDIT-TIME.
007600     PERFORM CHECK-TIME.
007700     PERFORM FORMAT-THE-TIME.
007800
007900 EDIT-TIME.
008000     MOVE FORMATTED-TIME TO TIME-HHMMSS.
008100
008200 CHECK-TIME.
008300     MOVE "Y" TO VALID-TIME-FLAG.
008400     IF TIME-HHMMSS = ZEROES
008500         IF ZERO-TIME-IS-OK = "Y"
008600             MOVE "0" TO VALID-TIME-FLAG
008700         ELSE
008800             MOVE "N" TO VALID-TIME-FLAG
008900     ELSE
009000     IF TIME-HH > 24
009100         MOVE "N" TO VALID-TIME-FLAG
009200     ELSE
009300     IF TIME-MM > 59
009400         MOVE "N" TO VALID-TIME-FLAG
009500     ELSE
009600     IF TIME-SS > 59
009700         MOVE "N" TO VALID-TIME-FLAG
009800     ELSE
009900     IF TIME-HHMMSS > 240000
010000         MOVE "N" TO VALID-TIME-FLAG.
010100
010200 FORMAT-THE-TIME.
010300     MOVE TIME-HHMMSS TO FORMATTED-TIME.
010400     INSPECT FORMATTED-TIME
010500       REPLACING ALL "/" BY ":".
010600
