000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. RANGE02.
000300*------------------------------------------------
000400* ASKS USER FOR A NUMBER BETWEEN 10 AND 100
000500* EXCLUSIVE AND PRINTS A MESSAGE IF THE ENTRY
000600* IS IN RANGE.
000700*------------------------------------------------
000800 ENVIRONMENT DIVISION.
000900 DATA DIVISION.
001000 WORKING-STORAGE SECTION.
001100
001200 01  THE-NUMBER           PIC 999.
001300
001400 PROCEDURE DIVISION.
001500 PROGRAM-BEGIN.
001600
001700     PERFORM GET-THE-NUMBER.
001800
001900     PERFORM CHECK-THE-NUMBER.
002000
002100 PROGRAM-DONE.
002200     ACCEPT OMITTED. STOP RUN.
002300
002400 GET-THE-NUMBER.
002500     DISPLAY "Enter a number greater than 10".
002600     DISPLAY "and less than 100. (011-099)".
002700     ACCEPT THE-NUMBER.
002800
002900 CHECK-THE-NUMBER.
003000     IF THE-NUMBER > 10 AND
003100        THE-NUMBER < 100
003200         DISPLAY "The number is in range."
003300     ELSE
003400         DISPLAY "The number is out of range.".
003500
