000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. JACK06.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500
000600 WORKING-STORAGE SECTION.
000700
000800 01  THE-WHOLE-MESSAGE.
000900     05  THE-NUMBER       PIC 9(2) VALUE 1.
001000     05  A-SPACE          PIC X    VALUE SPACE.
001100     05  THE-MESSAGE.
001200         10  JACKS-NAME   PIC X(5) VALUE "Jack".
001300         10  JACKS-TASK   PIC X(45).
001400
001500 PROCEDURE DIVISION.
001600 PROGRAM-BEGIN.
001700
001800* Set up and display line 1
001900     MOVE "be nimble," TO JACKS-TASK.
002000     DISPLAY THE-WHOLE-MESSAGE.
002100
002200* Set up and Display line 2
002300     MOVE "be quick," TO JACKS-TASK.
002400     ADD 1 TO THE-NUMBER.
002500     DISPLAY THE-WHOLE-MESSAGE.
002600
002700* Set up and display line 3
002800     MOVE "jump over the candlestick." TO JACKS-TASK.
002900     ADD 1 TO THE-NUMBER.
003000     DISPLAY THE-WHOLE-MESSAGE.
003100
003200* Display a closing message
003300     MOVE "That's all folks" TO THE-WHOLE-MESSAGE.
003400     DISPLAY THE-WHOLE-MESSAGE.
003500
003600 PROGRAM-DONE.
003700     ACCEPT OMITTED. STOP RUN.
003800
