000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. MENU03.
000300*------------------------------------------------
000400* THIS PROGRAM DISPLAYS A THREE CHOICE MENU OF
000500* MESSAGES THAT CAN BE DISPLAYED.
000600* THE USER ENTERS THE CHOICE, 1, 2 OR 3, AND
000700* THE APPROPRIATE MESSAGE IS DISPLAYED.
000800* AN ERROR MESSAGE IS DISPLAYED IF AN INVALID
000900* CHOICE IS MADE.
001000*------------------------------------------------
001100 ENVIRONMENT DIVISION.
001200 DATA DIVISION.
001300 WORKING-STORAGE SECTION.
001400
001500 01  MENU-PICK         PIC 9.
001600     88  PICK-IS-EXIT  VALUE 9.
001700     88  PICK-IS-VALID VALUES 1 THRU 3, 9.
001800
001900 PROCEDURE DIVISION.
002000 PROGRAM-BEGIN.
002100
002200     MOVE 1 TO MENU-PICK.
002300     PERFORM GET-AND-DO-PICK
002400         UNTIL PICK-IS-EXIT.
002500*              MENU-PICK = 9
002600
002700     DISPLAY "Thank you. Exiting".
002800
002900 PROGRAM-DONE.
003000     ACCEPT OMITTED. STOP RUN.
003100
003200 GET-AND-DO-PICK.
003300     PERFORM GET-THE-MENU-PICK.
003400
003500     PERFORM DO-THE-MENU-PICK.
003600
003700 GET-THE-MENU-PICK.
003800
003900     PERFORM DISPLAY-THE-MENU.
004000     PERFORM GET-THE-PICK.
004100
004200 DO-THE-MENU-PICK.
004300*       NOT ( MENU-PICK = 1 OR 2 OR 3 OR 9 )
004400     IF NOT PICK-IS-VALID
004500         DISPLAY "Invalid selection".
004600
004700     IF MENU-PICK = 1
004800         DISPLAY "One for the money.".
004900
005000     IF MENU-PICK = 2
005100         DISPLAY "Two for the show.".
005200
005300     IF MENU-PICK = 3
005400         DISPLAY "Three to get ready.".
005500
005600* LEVEL 3 ROUTINES
005700 DISPLAY-THE-MENU.
005800     DISPLAY "Please enter the number of the message".
005900     DISPLAY "that you wish to display.".
006000* Display a blank line
006100     DISPLAY " ".
006200     DISPLAY "1.  First Message".
006300     DISPLAY "2.  Second Message".
006400     DISPLAY "3.  Third Message".
006500* Display a blank line
006600     DISPLAY " ".
006700     DISPLAY "9.  EXIT".
006800     DISPLAY " ".
006900     DISPLAY "Your selection (1-3)?".
007000
007100 GET-THE-PICK.
007200     ACCEPT MENU-PICK.
007300
