000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. NUMS01.
000300*------------------------------------------------
000400* Illustrates how decimal data is displayed
000500* when edited.
000600*------------------------------------------------
000700 ENVIRONMENT DIVISION.
000800 DATA DIVISION.
000900 WORKING-STORAGE SECTION.
001000
001100 01  ENTRY-FIELD    PIC -ZZZ,ZZZ.ZZ.
001200 01  THE-VALUE      PIC S999999V99.
001300
001400 01  EDITED-DISPLAY-1      PIC -999999.99.
001500 01  EDITED-DISPLAY-2      PIC ZZZZZ9.99-.
001600 01  EDITED-DISPLAY-3      PIC ZZZZZZ.ZZ-.
001700 01  EDITED-DISPLAY-4      PIC ZZZ,ZZZ.ZZ-.
001800
001900 PROCEDURE DIVISION.
002000 PROGRAM-BEGIN.
002100
002200     DISPLAY "PLEASE ENTER A VALUE".
002300     ACCEPT ENTRY-FIELD WITH CONVERSION.
002400*or  ACCEPT ENTRY-FIELD CONVERT.
002500*or  ACCEPT ENTRY-FIELD.
002600     MOVE ENTRY-FIELD TO THE-VALUE.
002700
002800     MOVE THE-VALUE TO EDITED-DISPLAY-1
002900                       EDITED-DISPLAY-2
003000                       EDITED-DISPLAY-3
003100                       EDITED-DISPLAY-4.
003200
003300     DISPLAY ENTRY-FIELD      "|"
003400             EDITED-DISPLAY-1 "|"
003500             EDITED-DISPLAY-2 "|"
003600             EDITED-DISPLAY-3 "|"
003700             EDITED-DISPLAY-4 "|".
003800
003900     IF THE-VALUE NOT = ZERO
004000         GO TO PROGRAM-BEGIN.
004100
004200 PROGRAM-DONE.
004300     ACCEPT OMITTED. STOP RUN.
004400
