000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. TIME02.
000300*---------------------------------
000400* Testing Time Entry and handling
000500*---------------------------------
000600 ENVIRONMENT DIVISION.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200
001300 WORKING-STORAGE SECTION.
001400
001500 77  ANY-TIME           PIC 9(6) VALUE ZEROES.
001600
001700 77  ANY-FORMATTED      PIC X(8).
001800
001900 77  FORMATTED-TIME     PIC Z9/99/99.
002000
002100 77  THE-TIME           PIC 9(6).
002200
002300 77  ZERO-IS-OK    PIC X VALUE "N".
002400
002500 PROCEDURE DIVISION.
002600 PROGRAM-BEGIN.
002700     PERFORM OPENING-PROCEDURE.
002800     PERFORM MAIN-PROCESS.
002900     PERFORM CLOSING-PROCEDURE.
003000
003100 PROGRAM-EXIT.
003200     EXIT PROGRAM.
003300
003400 PROGRAM-DONE.
003500     STOP RUN.
003600
003700 OPENING-PROCEDURE.
003800
003900 CLOSING-PROCEDURE.
004000
004100 MAIN-PROCESS.
004200     PERFORM GET-ANY-TIME.
004300     PERFORM DISPLAY-AND-GET-ANY-TIME
004400         UNTIL ANY-TIME = 000001.
004500
004600 GET-ANY-TIME.
004700     MOVE "Y" TO ZERO-IS-OK.
004800     PERFORM GET-THE-TIME.
004900     MOVE THE-TIME TO ANY-TIME.
005000     MOVE FORMATTED-TIME TO ANY-FORMATTED.
005100
005200 GET-THE-TIME.
005300     CALL "TIMEDIT" USING
005400          THE-TIME FORMATTED-TIME
005500          ZERO-IS-OK.
005600
005700 DISPLAY-AND-GET-ANY-TIME.
005800     PERFORM DISPLAY-THE-TIME.
005900     PERFORM GET-ANY-TIME.
006000
006100 DISPLAY-THE-TIME.
006200     DISPLAY "ANY TIME IS " ANY-FORMATTED.
006300
