000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. COBSHL03.
000300*------------------------------------------------
000400* Comments go here.
000500*------------------------------------------------
000600 ENVIRONMENT DIVISION.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200
001300 WORKING-STORAGE SECTION.
001400
001500 PROCEDURE DIVISION.
001600 PROGRAM-BEGIN.
001700
001800 PROGRAM-DONE.
001900     ACCEPT OMITTED. STOP RUN.
002000
