000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. DADD.
000300 AUTHOR. MO BUDLONG.
000400 INSTALLATION.
000500 DATE-WRITTEN. 09/07/96.
000600 DATE-COMPILED.
000700 SECURITY. NONE
000800 ENVIRONMENT DIVISION.
000900 INPUT-OUTPUT SECTION.
001000 FILE-CONTROL.
001100 DATA DIVISION.
001200 FILE SECTION.
001300 WORKING-STORAGE SECTION.
001400
001500 01  CD-DATE.
001600     05  CD-CCYYMMDD          PIC 9(8).
001700     05  FILLER               PIC X(13).
001800 01  NEW-DATE                 PIC 9(8).
001900 01  DAYS-TO-ADD              PIC S9(5).
002000 01  FORMAT-DAYS-TO-ADD       PIC ZZZZ9-.
002100
002200 01  DUMMY     PIC X.
002300
002400 PROCEDURE DIVISION.
002500 MAIN-LOGIC SECTION.
002600 PROGRAM-BEGIN.
002700
002800     PERFORM OPENING-PROCEDURE.
002900     PERFORM MAIN-PROCESS.
003000     PERFORM CLOSING-PROCEDURE.
003100
003200 EXIT-PROGRAM.
003300     EXIT PROGRAM.
003400 STOP-RUN.
003500     ACCEPT OMITTED. STOP RUN.
003600
003700
003800 THE-OTHER SECTION.
003900
004000 OPENING-PROCEDURE.
004100 CLOSING-PROCEDURE.
004200 MAIN-PROCESS.
004300     MOVE 1 TO DAYS-TO-ADD.
004400     PERFORM ENTER-PARAMETERS.
004500     PERFORM TEST-DADD UNTIL
004600         DAYS-TO-ADD = 0.
004700
004800 ENTER-PARAMETERS.
004900     DISPLAY "ENTER NUMBER-OF-DAYS TO ADD (0 TO QUIT)".
005000     ACCEPT DAYS-TO-ADD.
005100     MOVE DAYS-TO-ADD TO FORMAT-DAYS-TO-ADD.
005200
005300 TEST-DADD.
005400     MOVE FUNCTION CURRENT-DATE TO CD-DATE.
005500
005600     COMPUTE NEW-DATE =
005700         FUNCTION DATE-OF-INTEGER(
005800            FUNCTION INTEGER-OF-DATE(CD-CCYYMMDD)
005900          + DAYS-TO-ADD).
006000
006100     DISPLAY "CURRENT DATE " CD-CCYYMMDD
006200             " + "  FORMAT-DAYS-TO-ADD
006300             " WILL BE " NEW-DATE.
006400
006500     PERFORM ENTER-PARAMETERS.
006600
