000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. STCBLD01.
000300*------------------------------------------------
000400* Create an Empty State Code File.
000500*------------------------------------------------
000600 ENVIRONMENT DIVISION.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900
001000     COPY "SLSTATE.CBL".
001100
001200 DATA DIVISION.
001300 FILE SECTION.
001400
001500     COPY "FDSTATE.CBL".
001600
001700 WORKING-STORAGE SECTION.
001800
001900 PROCEDURE DIVISION.
002000 PROGRAM-BEGIN.
002100     OPEN OUTPUT STATE-FILE.
002200     CLOSE STATE-FILE.
002300
002400 PROGRAM-DONE.
002500     ACCEPT OMITTED. STOP RUN.
