000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. UPPER01.
000300*------------------------------------------------
000400* Converts input to upper case.
000500*------------------------------------------------
000600 ENVIRONMENT DIVISION.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200
001300 WORKING-STORAGE SECTION.
001400
001500 77  UPPER-ALPHA           PIC X(26) VALUE
001600     "ABCDEFGHIJKLMNOPQRSTUVWXYZ".
001700 77  LOWER-ALPHA           PIC X(26) VALUE
001800     "abcdefghijklmnopqrstuvwxyz".
001900
002000 77  TEST-FIELD            PIC X(30) VALUE SPACE.
002100 PROCEDURE DIVISION.
002200 PROGRAM-BEGIN.
002300     PERFORM ENTER-TEST-FIELD.
002400     PERFORM CONVERT-AND-ENTER
002500         UNTIL TEST-FIELD = SPACE.
002600
002700 PROGRAM-DONE.
002800     ACCEPT OMITTED. STOP RUN.
002900
003000 ENTER-TEST-FIELD.
003100     DISPLAY "Enter upper or lower case data".
003200     DISPLAY "Leave Blank to End".
003300     ACCEPT TEST-FIELD.
003400 CONVERT-AND-ENTER.
003500     PERFORM CONVERT-TEST-FIELD.
003600     PERFORM ENTER-TEST-FIELD.
003700
003800 CONVERT-TEST-FIELD.
003900     INSPECT TEST-FIELD CONVERTING
004000         LOWER-ALPHA TO UPPER-ALPHA.
004100     DISPLAY TEST-FIELD.
