000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. MULT06.
000300*--------------------------------------------------
000400* This program asks the user for a number for a
000500* multiplication table, and a table size
000600* and then displays a table for that number
000700* times the values 1 through HOW-MANY.
000800*
000900* The display is paused after each 15 lines.
001000*--------------------------------------------------
001100 ENVIRONMENT DIVISION.
001200 DATA DIVISION.
001300 WORKING-STORAGE SECTION.
001400
001500 01  THE-NUMBER         PIC 99.
001600 01  THE-MULTIPLIER     PIC 999.
001700 01  THE-PRODUCT        PIC 9999.
001800 01  HOW-MANY           PIC 99.
001900 01  SCREEN-LINES       PIC 99.
002000
002100 01  A-DUMMY            PIC X.
002200
002300 PROCEDURE DIVISION.
002400* LEVEL 1 ROUTINES
002500 PROGRAM-BEGIN.
002600     PERFORM PROGRAM-INITIALIZATION.
002700     PERFORM GET-TABLE-DATA.
002800     PERFORM DISPLAY-THE-TABLE.
002900
003000 PROGRAM-DONE.
003100     STOP RUN.
003200
003300* LEVEL 2 ROUTINES
003400 PROGRAM-INITIALIZATION.
003500
003600     MOVE 0 TO SCREEN-LINES.
003700
003800 GET-TABLE-DATA.
003900     DISPLAY
004000     "Which multiplication table(01-99)?".
004100     ACCEPT THE-NUMBER.
004200
004300     DISPLAY "How many entries would you like (01-99)?".
004400     ACCEPT HOW-MANY.
004500
004600 DISPLAY-THE-TABLE.
004700     DISPLAY "The " THE-NUMBER "'s table is:".
004800     PERFORM CALCULATE-AND-DISPLAY
004900         VARYING THE-MULTIPLIER
005000           FROM 1 BY 1
005100           UNTIL THE-MULTIPLIER > HOW-MANY.
005200
005300* LEVEL 3 ROUTINES.
005400 CALCULATE-AND-DISPLAY.
005500
005600     IF SCREEN-LINES = 15
005700         DISPLAY "Press ENTER to continue . . ."
005800         ACCEPT A-DUMMY
005900         MOVE 0 TO SCREEN-LINES.
006000
006100     COMPUTE THE-PRODUCT = THE-NUMBER * THE-MULTIPLIER.
006200     DISPLAY
006300         THE-NUMBER " * " THE-MULTIPLIER " = " THE-PRODUCT.
006400
006500     ADD 1 TO SCREEN-LINES.
006600
