000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ADD07.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500
000600 WORKING-STORAGE SECTION.
000700
000800 01  FIRST-NUMBER      PIC 99.
000900 01  SECOND-NUMBER     PIC 99.
001000 01  THE-RESULT        PIC 999.
001100
001200 PROCEDURE DIVISION.
001300
001400 PROGRAM-BEGIN.
001500
001600     PERFORM ADVISE-THE-USER.
001700     PERFORM GET-FIRST-NUMBER.
001800     PERFORM GET-SECOND-NUMBER.
001900     PERFORM COMPUTE-AND-DISPLAY.
002000
002100 PROGRAM-DONE.
002200     ACCEPT OMITTED. STOP RUN.
002300
002400 ADVISE-THE-USER.
002500     DISPLAY "This program will add 2 numbers.".
002600
002700 GET-FIRST-NUMBER.
002800
002900     DISPLAY "Enter the first number.".
003000     ACCEPT FIRST-NUMBER.
003100
003200 GET-SECOND-NUMBER.
003300
003400     DISPLAY "Enter the second number.".
003500     ACCEPT SECOND-NUMBER.
003600
003700 COMPUTE-AND-DISPLAY.
003800
003900     COMPUTE THE-RESULT = FIRST-NUMBER + SECOND-NUMBER.
004000     DISPLAY "The result is " THE-RESULT.
004100
