000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. BILMNU03.
000300*---------------------------------
000400* Menu for the bill payment system.
000500* Including Vouchers
000600*---------------------------------
000700 ENVIRONMENT DIVISION.
000800 INPUT-OUTPUT SECTION.
000900 FILE-CONTROL.
001000
001100 DATA DIVISION.
001200 FILE SECTION.
001300
001400 WORKING-STORAGE SECTION.
001500
001600 77  MENU-PICK                    PIC 9.
001700     88  MENU-PICK-IS-VALID       VALUES 0 THRU 3.
001800
001900 PROCEDURE DIVISION.
002000 PROGRAM-BEGIN.
002100     PERFORM OPENING-PROCEDURE.
002200     PERFORM MAIN-PROCESS.
002300     PERFORM CLOSING-PROCEDURE.
002400
002500 PROGRAM-EXIT.
002600     EXIT PROGRAM.
002700
002800 PROGRAM-DONE.
002900     ACCEPT OMITTED. STOP RUN.
003000
003100 OPENING-PROCEDURE.
003200
003300 CLOSING-PROCEDURE.
003400
003500 MAIN-PROCESS.
003600     PERFORM GET-MENU-PICK.
003700     PERFORM DO-THE-PICK
003800         UNTIL MENU-PICK = 0.
003900
004000*---------------------------------
004100* MENU
004200*---------------------------------
004300 GET-MENU-PICK.
004400     PERFORM DISPLAY-THE-MENU.
004500     PERFORM ACCEPT-MENU-PICK.
004600     PERFORM RE-ACCEPT-MENU-PICK
004700         UNTIL MENU-PICK-IS-VALID.
004800
004900 DISPLAY-THE-MENU.
005000     PERFORM CLEAR-SCREEN.
005100     DISPLAY "    PLEASE SELECT:".
005200     DISPLAY " ".
005300     DISPLAY "          1.  STATE CODE MAINTENANCE".
005400     DISPLAY "          2.  VENDOR MAINTENANCE".
005500     DISPLAY "          3.  VOUCHER PROCESSING".
005600     DISPLAY " ".
005700     DISPLAY "          0.  EXIT".
005800     PERFORM SCROLL-LINE 8 TIMES.
005900
006000 ACCEPT-MENU-PICK.
006100     DISPLAY "YOUR CHOICE (0-3)?".
006200     ACCEPT MENU-PICK.
006300
006400 RE-ACCEPT-MENU-PICK.
006500     DISPLAY "INVALID SELECTION - PLEASE RE-TRY.".
006600     PERFORM ACCEPT-MENU-PICK.
006700
006800 CLEAR-SCREEN.
006900     PERFORM SCROLL-LINE 25 TIMES.
007000
007100 SCROLL-LINE.
007200     DISPLAY " ".
007300
007400 DO-THE-PICK.
007500     IF MENU-PICK = 1
007600         PERFORM STATE-MAINTENANCE
007700     ELSE
007800     IF MENU-PICK = 2
007900         PERFORM VENDOR-MAINTENANCE
008000     ELSE
008100     IF MENU-PICK = 3
008200         PERFORM VOUCHER-PROCESSING.
008300
008400     PERFORM GET-MENU-PICK.
008500
008600*---------------------------------
008700* STATE
008800*---------------------------------
008900 STATE-MAINTENANCE.
009000     CALL "STCMNT04".
009100
009200*---------------------------------
009300* VENDOR
009400*---------------------------------
009500 VENDOR-MAINTENANCE.
009600     CALL "VNDMNT05".
009700
009800*---------------------------------
009900* VOUCHERS
010000*---------------------------------
010100 VOUCHER-PROCESSING.
010200     CALL "VCHMNU01".
010300
