000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. COMMENT.
000300 ENVIRONMENT DIVISION.
       DATA DIVISION.                                                   MB092193
000500 PROCEDURE DIVISION.
000600 
000700* This is a comment.                                              MB092193
000800* This paragraph displays information about the program.          MB092193
000900 PROGRAM-BEGIN.
003700     DISPLAY "This program contains four DIVISIONS,".             MB092193
003800     DISPLAY "three PARAGRAPHS".                                  MB092193
001000     DISPLAY "and four SENTENCES".
001100 PROGRAM-DONE.
001200     ACCEPT OMITTED. STOP RUN.
