000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. COBSHL04.
000300*---------------------------------
000400*
000500*---------------------------------
000600 ENVIRONMENT DIVISION.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200
001300 WORKING-STORAGE SECTION.
001400
001500 PROCEDURE DIVISION.
001600 PROGRAM-BEGIN.
001700     PERFORM OPENING-PROCEDURE.
001800     PERFORM MAIN-PROCESS.
001900     PERFORM CLOSING-PROCEDURE.
002000
002100 PROGRAM-EXIT.
002200     EXIT PROGRAM.
002300
002400 PROGRAM-DONE.
002500     STOP RUN.
002600
002700 OPENING-PROCEDURE.
002800
002900 CLOSING-PROCEDURE.
003000
003100 MAIN-PROCESS.
003200
