000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. DATE06.
000300*---------------------------------
000400* Testing Date Entry and handling
000500*---------------------------------
000600 ENVIRONMENT DIVISION.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200
001300 WORKING-STORAGE SECTION.
001400
001500 77  ANY-DATE           PIC 9(8) VALUE ZEROES.
001600 77  REQUIRED-DATE      PIC 9(8) VALUE ZEROES.
001700
001800     COPY "WSDATE01.CBL".
001900
002000 PROCEDURE DIVISION.
002100 PROGRAM-BEGIN.
002200     PERFORM OPENING-PROCEDURE.
002300     PERFORM MAIN-PROCESS.
002400     PERFORM CLOSING-PROCEDURE.
002500
002600 PROGRAM-EXIT.
002700     EXIT PROGRAM.
002800
002900 PROGRAM-DONE.
003000     STOP RUN.
003100
003200 OPENING-PROCEDURE.
003300
003400 CLOSING-PROCEDURE.
003500
003600 MAIN-PROCESS.
003700     PERFORM GET-TWO-DATES.
003800     PERFORM DISPLAY-AND-GET-DATES
003900         UNTIL REQUIRED-DATE = 00010101.
004000
004100 GET-TWO-DATES.
004200     PERFORM GET-ANY-DATE.
004300     PERFORM GET-REQUIRED-DATE.
004400
004500 GET-ANY-DATE.
004600     MOVE "Y" TO ZERO-DATE-IS-OK.
004700     MOVE "ENTER AN OPTIONAL MM/DD/CCYY?" TO DATE-PROMPT.
004800     MOVE "MUST BE ANY VALID DATE" TO DATE-ERROR-MESSAGE.
004900     PERFORM GET-A-DATE.
005000     MOVE DATE-CCYYMMDD TO ANY-DATE.
005100
005200 GET-REQUIRED-DATE.
005300     MOVE "N" TO ZERO-DATE-IS-OK.
005400     MOVE SPACE TO DATE-PROMPT.
005500     MOVE "MUST ENTER A VALID DATE" TO DATE-ERROR-MESSAGE.
005600     PERFORM GET-A-DATE.
005700     MOVE DATE-CCYYMMDD TO REQUIRED-DATE.
005800
005900 DISPLAY-AND-GET-DATES.
006000     PERFORM DISPLAY-THE-DATES.
006100     PERFORM GET-TWO-DATES.
006200
006300 DISPLAY-THE-DATES.
006400     MOVE ANY-DATE TO DATE-CCYYMMDD.
006500     PERFORM FORMAT-THE-DATE.
006600     DISPLAY "ANY DATE IS " FORMATTED-DATE.
006700     MOVE REQUIRED-DATE TO DATE-CCYYMMDD.
006800     PERFORM FORMAT-THE-DATE.
006900     DISPLAY "REQUIRED DATE IS " FORMATTED-DATE.
007000
007100     COPY "PLDATE01.CBL".
007200
