000100*---------------------------------
000200* FDVOUCH.CBL - Primary Key - VOUCHER-NUMBER
000300* Dates are in CCYYMMDD format
000400*---------------------------------
000500 FD  VOUCHER-FILE
000600     LABEL RECORDS ARE STANDARD.
000700 01  VOUCHER-RECORD.
000800     05  VOUCHER-NUMBER           PIC 9(5).
000900     05  VOUCHER-VENDOR           PIC 9(5).
001000     05  VOUCHER-INVOICE          PIC X(15).
001100     05  VOUCHER-FOR              PIC X(30).
001200     05  VOUCHER-AMOUNT           PIC S9(6)V99.
001300     05  VOUCHER-DATE             PIC 9(8).
001400     05  VOUCHER-DUE              PIC 9(8).
001500     05  VOUCHER-DEDUCTIBLE       PIC X.
001600     05  VOUCHER-SELECTED         PIC X.
001700     05  VOUCHER-PAID-AMOUNT      PIC S9(6)V99.
001800     05  VOUCHER-PAID-DATE        PIC 9(8).
001900     05  VOUCHER-CHECK-NO         PIC 9(6).
002000
