000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. MENU02.
000300*------------------------------------------------
000400* THIS PROGRAM DISPLAYS A THREE CHOICE MENU OF
000500* MESSAGES THAT CAN BE DISPLAYED.
000600* THE USER ENTERS THE CHOICE, 1, 2 OR 3, AND
000700* THE APPROPRIATE MESSAGE IS DISPLAYED.
000800* AN ERROR MESSAGE IS DISPLAYED IF AN INVALID
000900* CHOICE IS MADE.
001000*------------------------------------------------
001100 ENVIRONMENT DIVISION.
001200 DATA DIVISION.
001300 WORKING-STORAGE SECTION.
001400
001500 01  MENU-PICK         PIC 9.
001600     88  PICK-IS-EXIT  VALUE 0.
001700
001800 PROCEDURE DIVISION.
001900 PROGRAM-BEGIN.
002000
002100     MOVE 1 TO MENU-PICK.
002200     PERFORM GET-AND-DO-PICK
002300         UNTIL PICK-IS-EXIT.
002400
002500     DISPLAY "Thank you. Exiting".
002600
002700 PROGRAM-DONE.
002800     STOP RUN.
002900
003000 GET-AND-DO-PICK.
003100     PERFORM GET-THE-MENU-PICK.
003200
003300     PERFORM DO-THE-MENU-PICK.
003400
003500 GET-THE-MENU-PICK.
003600
003700     PERFORM DISPLAY-THE-MENU.
003800     PERFORM GET-THE-PICK.
003900
004000 DO-THE-MENU-PICK.
004100     IF MENU-PICK > 3
004200         DISPLAY "Invalid selection".
004300
004400     IF MENU-PICK = 1
004500         DISPLAY "One for the money.".
004600
004700     IF MENU-PICK = 2
004800         DISPLAY "Two for the show.".
004900
005000     IF MENU-PICK = 3
005100         DISPLAY "Three to get ready.".
005200
005400 DISPLAY-THE-MENU.
000000* Includes the display of some blank lines to
000000* improve the appearance
005500     DISPLAY "Please enter the number of the message".
005600     DISPLAY "that you wish to display.".
005800     DISPLAY " ".
005900     DISPLAY "1.  First Message".
006000     DISPLAY "2.  Second Message".
006100     DISPLAY "3.  Third Message".
006300     DISPLAY " ".
006400     DISPLAY "0.  EXIT".
006500     DISPLAY " ".
006600     DISPLAY "Your selection (1-3)?".
006700
006800 GET-THE-PICK.
006900     ACCEPT MENU-PICK.
