000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. TRUNC01.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600
000700 01  6-BYTES      PIC X(6).
000800 01  5-BYTES      PIC X(5).
000900 01  4-BYTES      PIC X(4).
001000 01  3-BYTES      PIC X(3).
001100 01  2-BYTES      PIC X(2).
001200 01  1-BYTE       PIC X(1).
001300
001400 01  5-DIGITS     PIC 9(5).
001500 01  4-DIGITS     PIC 9(4).
001600 01  3-DIGITS     PIC 9(3).
001700 01  2-DIGITS     PIC 9(2).
001800 01  1-DIGIT      PIC 9(1).
001900
002000 PROCEDURE DIVISION.
002100 PROGRAM-BEGIN.
002200
002300     MOVE "Hello" TO 6-BYTES.
002400     MOVE "Hello" TO 5-BYTES.
002500     MOVE "Hello" TO 4-BYTES.
002600     MOVE "Hello" TO 3-BYTES.
002700     MOVE "Hello" TO 2-BYTES.
002800     MOVE "Hello" TO 1-BYTE.
002900
003000     MOVE 2397 TO 5-DIGITS.
003100     MOVE 2397 TO 4-DIGITS.
003200     MOVE 2397 TO 3-DIGITS.
003300     MOVE 2397 TO 2-DIGITS.
003400     MOVE 2397 TO 1-DIGIT.
003500
003600     DISPLAY 6-BYTES.
003700     DISPLAY 5-BYTES.
003800     DISPLAY 4-BYTES.
003900     DISPLAY 3-BYTES.
004000     DISPLAY 2-BYTES.
004100     DISPLAY 1-BYTE.
004200
004300     DISPLAY 5-DIGITS.
004400     DISPLAY 4-DIGITS.
004500     DISPLAY 3-DIGITS.
004600     DISPLAY 2-DIGITS.
004700     DISPLAY 1-DIGIT.
004800
004900
005000 PROGRAM-DONE.
005100     STOP RUN.
005200
