000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. TRUNC02.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600
000700 01  6-BYTES      PIC X(6) VALUE "Hello".
000800 01  5-BYTES      PIC X(5) VALUE "Hello".
000900 01  4-BYTES      PIC X(4) VALUE "Hello".
001000 01  3-BYTES      PIC X(3) VALUE "Hello".
001100 01  2-BYTES      PIC X(2) VALUE "Hello".
001200 01  1-BYTE       PIC X(1) VALUE "Hello".
001300
001400 01  5-DIGITS     PIC 9(5) VALUE 2397.
001500 01  4-DIGITS     PIC 9(4) VALUE 2397.
001600 01  3-DIGITS     PIC 9(3) VALUE 2397.
001700 01  2-DIGITS     PIC 9(2) VALUE 2397.
001800 01  1-DIGIT      PIC 9(1) VALUE 2397.
001900
002000 PROCEDURE DIVISION.
002100 PROGRAM-BEGIN.
002200
002300
002400     DISPLAY 6-BYTES.
002500     DISPLAY 5-BYTES.
002600     DISPLAY 4-BYTES.
002700     DISPLAY 3-BYTES.
002800     DISPLAY 2-BYTES.
002900     DISPLAY 1-BYTE.
003000
003100     DISPLAY 5-DIGITS.
003200     DISPLAY 4-DIGITS.
003300     DISPLAY 3-DIGITS.
003400     DISPLAY 2-DIGITS.
003500     DISPLAY 1-DIGIT.
003600
003700
003800 PROGRAM-DONE.
003900     STOP RUN.
004000
