000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. VCHMNU01.
000300*---------------------------------
000400* Menu for Voucher Processing
000500*---------------------------------
000600 ENVIRONMENT DIVISION.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200
001300 WORKING-STORAGE SECTION.
001400
001500 77  MENU-PICK                    PIC 9.
001600     88  MENU-PICK-IS-VALID       VALUES 0 THRU 7.
001700
001800 PROCEDURE DIVISION.
001900 PROGRAM-BEGIN.
002000     PERFORM OPENING-PROCEDURE.
002100     PERFORM MAIN-PROCESS.
002200     PERFORM CLOSING-PROCEDURE.
002300
002400 PROGRAM-EXIT.
002500     EXIT PROGRAM.
002600
002700 PROGRAM-DONE.
002800     STOP RUN.
002900
003000 OPENING-PROCEDURE.
003100
003200 CLOSING-PROCEDURE.
003300
003400 MAIN-PROCESS.
003500     PERFORM GET-MENU-PICK.
003600     PERFORM DO-THE-PICK
003700         UNTIL MENU-PICK = 0.
003800
003900*---------------------------------
004000* MENU
004100*---------------------------------
004200 GET-MENU-PICK.
004300     PERFORM DISPLAY-THE-MENU.
004400     PERFORM ACCEPT-MENU-PICK.
004500     PERFORM RE-ACCEPT-MENU-PICK
004600         UNTIL MENU-PICK-IS-VALID.
004700
004800 DISPLAY-THE-MENU.
004900     PERFORM CLEAR-SCREEN.
005000     DISPLAY "    PLEASE SELECT:".
005100     DISPLAY " ".
005200     DISPLAY "          1.  VOUCHER ENTRY".
005300     DISPLAY "          2.  BILLS REPORT".
005400     DISPLAY "          3.  SELECT VOUCHERS BY DUE DATE RANGE".
005500     DISPLAY "          4.  SELECT INDIVIDUAL VOUCHERS".
005600     DISPLAY "          5.  CLEAR PREVIOUS SELECTIONS".
005700     DISPLAY "          6.  CASH REQUIREMENTS REPORT".
005800     DISPLAY "          7.  PAID BILLS ENTRY".
005900     DISPLAY " ".
006000     DISPLAY "          0.  EXIT".
006100     PERFORM SCROLL-LINE 8 TIMES.
006200
006300 ACCEPT-MENU-PICK.
006400     DISPLAY "YOUR CHOICE (0-7)?".
006500     ACCEPT MENU-PICK.
006600
006700 RE-ACCEPT-MENU-PICK.
006800     DISPLAY "INVALID SELECTION - PLEASE RE-TRY.".
006900     PERFORM ACCEPT-MENU-PICK.
007000
007100 CLEAR-SCREEN.
007200     PERFORM SCROLL-LINE 25 TIMES.
007300
007400 SCROLL-LINE.
007500     DISPLAY " ".
007600
007700 DO-THE-PICK.
007800     IF MENU-PICK = 1
007900         PERFORM VOUCHER-ENTRY
008000     ELSE
008100     IF MENU-PICK = 2
008200         PERFORM BILLS-REPORT
008300     ELSE
008400     IF MENU-PICK = 3
008500         PERFORM DATE-SELECTION
008600     ELSE
008700     IF MENU-PICK = 4
008800         PERFORM SINGLE-SELECTION
008900     ELSE
009000     IF MENU-PICK = 5
009100         PERFORM CLEAR-SELECTIONS
009200     ELSE
009300     IF MENU-PICK = 6
009400         PERFORM CASH-REQUIREMENTS
009500     ELSE
009600     IF MENU-PICK = 7
009700         PERFORM PAID-ENTRY.
009800
009900     PERFORM GET-MENU-PICK.
010000
010100 VOUCHER-ENTRY.
010200     CALL "VCHMNT01".
010300
010400 BILLS-REPORT.
010500     CALL "BILRPT03".
010600
010700 DATE-SELECTION.
010800     CALL "VCHSEL01".
010900
011000 SINGLE-SELECTION.
011100     CALL "VCHPIC01".
011200
011300 CLEAR-SELECTIONS.
011400     CALL "VCHCLR01".
011500
011600 CASH-REQUIREMENTS.
011700     CALL "CSHREQ01".
011800
011900 PAID-ENTRY.
012000     CALL "VCHPAY02".
012100
012200
