000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. VNDFIX01.
000300*---------------------------------
000400* Repairs any lower case errors in
000500* the vendor file by converting the
000600* the whole record to upper case.
000700*---------------------------------
000800 ENVIRONMENT DIVISION.
000900 INPUT-OUTPUT SECTION.
001000 FILE-CONTROL.
001100
001200     COPY "SLVND01.CBL".
001300
001400 DATA DIVISION.
001500 FILE SECTION.
001600
001700     COPY "FDVND03.CBL".
001800
001900 WORKING-STORAGE SECTION.
002000
002100 77  VENDOR-AT-END         PIC X VALUE "N".
002200
002300     COPY "WSCASE01.CBL".
002400
002500 PROCEDURE DIVISION.
002600 PROGRAM-BEGIN.
002700     PERFORM OPENING-PROCEDURE.
002800     PERFORM MAIN-PROCESS.
002900     PERFORM CLOSING-PROCEDURE.
003000
003100 PROGRAM-DONE.
003200     STOP RUN.
003300
003400 OPENING-PROCEDURE.
003500     OPEN I-O VENDOR-FILE.
003600
003700 CLOSING-PROCEDURE.
003800     CLOSE VENDOR-FILE.
003900
004000 MAIN-PROCESS.
004100     PERFORM READ-NEXT-VENDOR-RECORD.
004200     PERFORM FIX-VENDOR-RECORDS
004300             UNTIL VENDOR-AT-END = "Y".
004400
004500 FIX-VENDOR-RECORDS.
004600     INSPECT VENDOR-RECORD
004700        CONVERTING LOWER-ALPHA
004800        TO         UPPER-ALPHA.
004900     PERFORM REWRITE-VENDOR-RECORD.
005000
005100     PERFORM READ-NEXT-VENDOR-RECORD.
005200
005300 READ-NEXT-VENDOR-RECORD.
005400     MOVE "N" TO VENDOR-AT-END.
005500     READ VENDOR-FILE NEXT RECORD
005600         AT END MOVE "Y" TO VENDOR-AT-END.
005700
005800*or  READ VENDOR-FILE NEXT RECORD WITH LOCK
005900*        AT END MOVE "Y" TO VENDOR-AT-END.
006000
006100*or  READ VENDOR-FILE NEXT RECORD WITH HOLD
006200*        AT END MOVE "Y" TO VENDOR-AT-END.
006300
006400 REWRITE-VENDOR-RECORD.
006500     REWRITE VENDOR-RECORD
006600         INVALID KEY
006700         DISPLAY "ERROR REWRITING VENDOR RECORD".
006800
