000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. YESNO05.
000300*--------------------------------------------------
000400* This program asks for a Y or N answer, and then
000500* displays whether the user chose yes or no
000600* or an invalid entry.
000700* The edit logic allows for entry of Y, y, N, or n.
000800*--------------------------------------------------
000900 ENVIRONMENT DIVISION.
001000 DATA DIVISION.
001100 WORKING-STORAGE SECTION.
001200
001300 01  YES-OR-NO      PIC X.
001400
001500 PROCEDURE DIVISION.
001600 PROGRAM-BEGIN.
001700
001800     PERFORM GET-THE-ANSWER.
001900
002000     PERFORM EDIT-THE-ANSWER.
002100
002200     PERFORM DISPLAY-THE-ANSWER.
002300
002400 PROGRAM-DONE.
002500     STOP RUN.
002600
002700 GET-THE-ANSWER.
002800
002900     DISPLAY "Is the answer Yes or No? (Y/N)".
003000     ACCEPT YES-OR-NO.
003100
003200 EDIT-THE-ANSWER.
003300
003400     IF YES-OR-NO = "y"
003500         MOVE "Y" TO YES-OR-NO.
003600
003700     IF YES-OR-NO = "n"
003800         MOVE "N" TO YES-OR-NO.
003900
004000 DISPLAY-THE-ANSWER.
004100
004200     IF YES-OR-NO = "Y" OR
004300        YES-OR-NO = "N"
004400         PERFORM DISPLAY-YES-OR-NO
004500     ELSE
004600         DISPLAY "Your entry was invalid.".
004700
004800 DISPLAY-YES-OR-NO.
004900
005000     IF YES-OR-NO = "Y"
005100         DISPLAY "You answered Yes.".
005200
005300     IF YES-OR-NO = "N"
005400         DISPLAY "You answered No.".
005500
