000100 IDENTIFICATION DIVISION.
000200
000300 CLASS-ID. CreditSample
000400             DATA IS PROTECTED
000500             INHERITS FROM ACCOUNT
000600             WITH DATA.
000700
000800 ENVIRONMENT DIVISION.
000900 OBJECT SECTION.
001000 CLASS-CONTROL.
001100     CreditSample IS CLASS "CRDSMP"
001200     ACCOUNT IS CLASS "ACCTCLS".
001300
001400 DATA DIVISION.
001500 WORKING-STORAGE SECTION.
001600
001700 OBJECT.
001800 OBJECT-STORAGE SECTION.
001900
002000 END OBJECT.
002100 END CLASS CreditSample.
002200
