000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. STRNG.
000300 AUTHOR. MO BUDLONG.
000400 INSTALLATION.
000500 DATE-WRITTEN. 09/07/96.
000600 DATE-COMPILED.
000700 SECURITY. NONE
000800 ENVIRONMENT DIVISION.
000900 INPUT-OUTPUT SECTION.
001000 FILE-CONTROL.
001100 DATA DIVISION.
001200 FILE SECTION.
001300 WORKING-STORAGE SECTION.
001400
001500 01  ALPHA-FIELD              PIC X(26).
001600 01  SECOND-FIELD             PIC X(26).
001700
001800 01  DUMMY     PIC X.
001900
002000 PROCEDURE DIVISION.
002100 MAIN-LOGIC SECTION.
002200 PROGRAM-BEGIN.
002300
002400     PERFORM OPENING-PROCEDURE.
002500     PERFORM MAIN-PROCESS.
002600     PERFORM CLOSING-PROCEDURE.
002700
002800 EXIT-PROGRAM.
002900     EXIT PROGRAM.
003000 STOP-RUN.
003100     STOP RUN.
003200
003300
003400 THE-OTHER SECTION.
003500
003600 OPENING-PROCEDURE.
003700 CLOSING-PROCEDURE.
003800 MAIN-PROCESS.
003900
004000     MOVE FUNCTION UPPER-CASE("goodbye") TO ALPHA-FIELD.
004100
004200     DISPLAY ALPHA-FIELD.
004300
004400     MOVE FUNCTION LOWER-CASE(ALPHA-FIELD) TO SECOND-FIELD.
004500
004600     DISPLAY "ALPHA  = " ALPHA-FIELD.
004700     DISPLAY "SECOND = " SECOND-FIELD.
004800
004900     MOVE "abcdefghijklmnopqrstuvwxyz" TO ALPHA-FIELD.
005000
005100     STRING
005200      FUNCTION UPPER-CASE( "hello") DELIMITED BY SIZE
005300      INTO ALPHA-FIELD.
005400
005500     DISPLAY FUNCTION REVERSE(ALPHA-FIELD).
005600
005700     ACCEPT DUMMY.
005800
