000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. DATE04.
000300*---------------------------------
000400* Demo of Date Entry and validation
000500*---------------------------------
000600 ENVIRONMENT DIVISION.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200
001300 WORKING-STORAGE SECTION.
001400
001500     COPY "WSDATE.CBL".
001600
001700 PROCEDURE DIVISION.
001800 PROGRAM-BEGIN.
001900     PERFORM OPENING-PROCEDURE.
002000     PERFORM MAIN-PROCESS.
002100     PERFORM CLOSING-PROCEDURE.
002200
002300 PROGRAM-EXIT.
002400     EXIT PROGRAM.
002500
002600 PROGRAM-DONE.
002700     ACCEPT OMITTED. STOP RUN.
002800
002900 OPENING-PROCEDURE.
003000
003100 CLOSING-PROCEDURE.
003200
003300 MAIN-PROCESS.
003400     PERFORM GET-A-DATE.
003500     PERFORM DISPLAY-AND-GET-DATE
003600         UNTIL DATE-MMDDCCYY = ZEROES.
003700
003800     COPY "PLDATE.CBL".
003900
004000 DISPLAY-AND-GET-DATE.
004100     PERFORM DISPLAY-A-DATE.
004200     PERFORM GET-A-DATE.
004300
004400 DISPLAY-A-DATE.
004500     MOVE DATE-MMDDCCYY TO DATE-ENTRY-FIELD.
004600     DISPLAY "FORMATTED DATE IS " DATE-ENTRY-FIELD.
004700     DISPLAY "DATE-MMDDCCYY IS " DATE-MMDDCCYY.
004800     DISPLAY "DATE-CCYYMMDD IS " DATE-CCYYMMDD.
004900
